---
kind: enumMember
id: F:Autodesk.Revit.DB.PropOverrideMode.ByLayer
enum: Autodesk.Revit.DB.PropOverrideMode
source: html/8d32fcba-032e-fd21-2b94-f115733fcbaa.htm
---
# Autodesk.Revit.DB.PropOverrideMode.ByLayer

All properties BYLAYER, no overrides
 Forces all entities to follow visual properties as set by their layer.
 Visual fidelity is lost, but this produces the least number of layers
 while still providing by-layer control over exported entities.